In [1]:
import numpy as np
import pandas as pd

In [23]:
dept_manager=pd.read_csv('dept_manager.csv')
dept_emp=pd.read_csv('dept_emp.csv')
employees=pd.read_csv('employees.csv')
salaries=pd.read_csv('salaries.csv')

In [24]:
salaries.head()

   emp_no  salary
0   10001   60117
1   10002   65828
2   10003   40006
3   10004   40054
4   10005   78228

In [31]:
dept_emp[dept_emp['dept_no'].duplicated()==True]

        emp_no dept_no
3        10004    d004
5        10006    d005
7        10008    d005
9        10010    d004
10       10010    d006
...        ...     ...
331598  499995    d004
331599  499996    d004
331600  499997    d005
331601  499998    d002
331602  499999    d004

[331594 rows x 2 columns]